# Transforming Data

Data typically does not come in a single file. There could be several data files as it makes storage and sharing records easier. In some cases, if many data points are collected, there could be daily files and they can even be from different sources. Therefore, it is important to combine data for cleaning and analysis.

## Concatenation

Pandas `concat` method allows combining multiple DataFrames into one. If shapes (i.e., dimensions) of concatenated DataFrames do not match, missing values are replaced with `NaN`.

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
np.random.seed(25)

df1 = pd.DataFrame(np.random.randint(100, 200, 25).reshape(5, 5))
df2 = pd.DataFrame(np.random.randint(200, 300, 15).reshape(3, 5))

In [ ]:
df1

     0    1    2    3    4
0  104  162  190  115  161
1  123  144  150  108  128
2  104  189  131  169  101
3  139  103  188  155  103
4  184  145  103  101  122

In [ ]:
df2

     0    1    2    3    4
0  231  248  247  273  216
1  250  285  236  209  232
2  210  260  247  201  286

In [ ]:
df3 = pd.concat([df1, df2])
df3

     0    1    2    3    4
0  104  162  190  115  161
1  123  144  150  108  128
2  104  189  131  169  101
3  139  103  188  155  103
4  184  145  103  101  122
0  231  248  247  273  216
1  250  285  236  209  232
2  210  260  247  201  286

By default, `concat` method keeps original indices from merged DataFrames. This can lead into problems if indices are in consecutive integer form. To avoid this issue, we can have the `concat` method to reindex the result by passing `ignore_index=True` argument.

In [ ]:
df4 = pd.concat([df1, df2], ignore_index=True)
df4

     0    1    2    3    4
0  104  162  190  115  161
1  123  144  150  108  128
2  104  189  131  169  101
3  139  103  188  155  103
4  184  145  103  101  122
5  231  248  247  273  216
6  250  285  236  209  232
7  210  260  247  201  286

By default, `concat` method concatenates DataFrames row-wise. If we need to concatenate DataFrames column-wise, we need to pass `axis=1` argument.

In [ ]:
df5 = pd.concat([df1, df2], axis=1)
df5

     0    1    2    3    4      0      1      2      3      4
0  104  162  190  115  161  231.0  248.0  247.0  273.0  216.0
1  123  144  150  108  128  250.0  285.0  236.0  209.0  232.0
2  104  189  131  169  101  210.0  260.0  247.0  201.0  286.0
3  139  103  188  155  103    NaN    NaN    NaN    NaN    NaN
4  184  145  103  101  122    NaN    NaN    NaN    NaN    NaN

In [ ]:
df6 = pd.concat([df1, df2], axis=1, ignore_index=True)
df6

     0    1    2    3    4      5      6      7      8      9
0  104  162  190  115  161  231.0  248.0  247.0  273.0  216.0
1  123  144  150  108  128  250.0  285.0  236.0  209.0  232.0
2  104  189  131  169  101  210.0  260.0  247.0  201.0  286.0
3  139  103  188  155  103    NaN    NaN    NaN    NaN    NaN
4  184  145  103  101  122    NaN    NaN    NaN    NaN    NaN

## Deleting Rows and Columns

To remove rows or columns from a DataFrame, the `drop` method with proper axis parameter can be used. The `drop` methods accepts a list of labels or indices to be removed from a DataFrame.

In [ ]:
df1 = pd.DataFrame(np.random.randint(100, 200, 36).reshape(6, 6))
df1

     0    1    2    3    4    5
0  191  149  118  192  136  198
1  130  138  102  105  157  173
2  122  111  102  143  190  161
3  184  183  174  117  114  183
4  137  187  150  151  114  171
5  162  190  115  114  176  139

In [ ]:
df1.drop([1, 3])

     0    1    2    3    4    5
0  191  149  118  192  136  198
2  122  111  102  143  190  161
4  137  187  150  151  114  171
5  162  190  115  114  176  139

In [ ]:
df1.drop([2, 4], axis=1)

     0    1    3    5
0  191  149  192  198
1  130  138  105  173
2  122  111  143  161
3  184  183  117  183
4  137  187  151  171
5  162  190  114  139

## Adding Rows

Pandas DataFrame has `append` method that adds row(s) to the end of it. This method accepts a list of values, Series, or DataFrames. Similar to `concat` method, it supports `ignore_index=True` argument to reindex added rows.

In [ ]:
df1 = pd.DataFrame(np.random.randint(100, 200, 36).reshape(6, 6))
df1

     0    1    2    3    4    5
0  188  146  153  129  113  146
1  153  162  167  102  144  144
2  163  145  124  109  167  159
3  179  132  195  105  156  136
4  183  119  111  137  166  155
5  117  186  129  124  112  171

In [ ]:
df1 = df1.append([[1, 2, 3, 4, 5, 6]], ignore_index=True)
df1

     0    1    2    3    4    5
0  188  146  153  129  113  146
1  153  162  167  102  144  144
2  163  145  124  109  167  159
3  179  132  195  105  156  136
4  183  119  111  137  166  155
5  117  186  129  124  112  171
6    1    2    3    4    5    6

In [ ]:
sr1 = pd.Series(range(300, 306))
sr1

0    300
1    301
2    302
3    303
4    304
5    305
dtype: int64

In [ ]:
df1 = df1.append(sr1, ignore_index=True)
df1

     0    1    2    3    4    5
0  188  146  153  129  113  146
1  153  162  167  102  144  144
2  163  145  124  109  167  159
3  179  132  195  105  156  136
4  183  119  111  137  166  155
5  117  186  129  124  112  171
6    1    2    3    4    5    6
7  300  301  302  303  304  305

`append` method accepts a list of values (i.e., rows) to be added as well.

In [ ]:
df1.append([np.arange(306, 312), np.arange(312, 318)], ignore_index=True)

     0    1    2    3    4    5
0  188  146  153  129  113  146
1  153  162  167  102  144  144
2  163  145  124  109  167  159
3  179  132  195  105  156  136
4  183  119  111  137  166  155
5  117  186  129  124  112  171
6    1    2    3    4    5    6
7  300  301  302  303  304  305
8  306  307  308  309  310  311
9  312  313  314  315  316  317

## Merging Data

Concatenation can be thought of as putting data that was once combined, back together. Sometimes we want to combine different types of data that come from different sources. Merging data is similar to joining tables in SQL. It helps us combine disparate datasets based on common columns. Pandas provides `merge` method to combine data sets using specific columns.

In [ ]:
census2010 = pd.read_csv("census2010.csv")
census2010.head()

       Geography  Census 2010
0  United States    308745538
1        Alabama      4779736
2         Alaska       710231
3        Arizona      6392017
4       Arkansas      2915918

In [ ]:
estimate2018 = pd.read_csv("estimate2018.csv")
estimate2018.head()

          State  Estimate 2018
0    New Mexico        2095428
1  South Dakota         882235
2        Alaska         737438
3       Florida       21299325
4   Puerto Rico        3195153

For these two data sets, `concat` method will not work as they have different order and column names. We want to merge these two data sets using the state column ("Geography" in the first DataFrame and "State" in the second). First, let's see how `concat` method works for these two data sets.

In [ ]:
pd.concat([census2010, estimate2018], sort=True)

    Census 2010  Estimate 2018             Geography           State
0   308745538.0            NaN         United States             NaN
1     4779736.0            NaN               Alabama             NaN
2      710231.0            NaN                Alaska             NaN
3     6392017.0            NaN               Arizona             NaN
4     2915918.0            NaN              Arkansas             NaN
5    37253956.0            NaN            California             NaN
6     5029196.0            NaN              Colorado             NaN
7     3574097.0            NaN           Connecticut             NaN
8      897934.0            NaN              Delaware             NaN
9      601723.0            NaN  District of Columbia             NaN
10   18801310.0            NaN               Florida             NaN
11    9687653.0            NaN               Georgia             NaN
12    1360301.0            NaN                Hawaii             NaN
13    1567582.0            NaN                 Idaho             NaN
14   12830632.0            NaN              Illinois             NaN
15    6483802.0            NaN               Indiana             NaN
16    3046355.0            NaN                  Iowa             NaN
17    2853118.0            NaN                Kansas             NaN
18    4339367.0            NaN              Kentucky             NaN
19    4533372.0            NaN             Louisiana             NaN
20    1328361.0            NaN                 Maine             NaN
21    5773552.0            NaN              Maryland             NaN
22    6547629.0            NaN         Massachusetts             NaN
23    9883640.0            NaN              Michigan             NaN
24    5303925.0            NaN             Minnesota             NaN
25    2967297.0            NaN           Mississippi             NaN
26    5988927.0            NaN              Missouri             NaN
27     989415.0            NaN               Montana             NaN
28    1826341.0            NaN              Nebraska             NaN
29    2700551.0            NaN                Nevada             NaN
..          ...            ...                   ...             ...
23          NaN       760077.0                   NaN    North Dakota
24          NaN      5813568.0                   NaN       Wisconsin
25          NaN      1062305.0                   NaN         Montana
26          NaN      2911505.0                   NaN          Kansas
27          NaN      3943079.0                   NaN        Oklahoma
28          NaN      9995915.0                   NaN        Michigan
29          NaN      8908520.0                   NaN      New Jersey
30          NaN       967171.0                   NaN        Delaware
31          NaN      6691878.0                   NaN         Indiana
32          NaN      1754208.0                   NaN           Idaho
33          NaN      4468402.0                   NaN        Kentucky
34          NaN      3013825.0                   NaN        Arkansas
35          NaN      6770010.0                   NaN       Tennessee
36          NaN      3034392.0                   NaN          Nevada
37          NaN     19542209.0                   NaN        New York
38          NaN      6126452.0                   NaN        Missouri
39          NaN      1057315.0                   NaN    Rhode Island
40          NaN      5611179.0                   NaN       Minnesota
41          NaN      5084127.0                   NaN  South Carolina
42          NaN     39557045.0                   NaN      California
43          NaN      1338404.0                   NaN           Maine
44          NaN     28701845.0                   NaN           Texas
45          NaN      8517685.0                   NaN        Virginia
46          NaN      4190713.0                   NaN          Oregon
47          NaN      7171646.0                   NaN         Arizona
48          NaN      5695564.0                   NaN        Colorado
49          NaN      4887871.0                   NaN         Alabama
50          NaN      4659978.0                   NaN       Louisiana
51          NaN      1356458.0                   NaN   New Hampshire
52          NaN      3572665.0                   NaN     Connecticut

[106 rows x 4 columns]

To use the `merge` method, we have to specify the DataFrame on the "left" and "right" and column in each to be used for merging data. If merge columns in both DataFrames have the same title, we can use the "on" argument.

In [ ]:
state_population = pd.merge(left=estimate2018, right=census2010, left_on="State", right_on="Geography")
state_population

                   State  Estimate 2018             Geography  Census 2010
0             New Mexico        2095428            New Mexico      2059179
1           South Dakota         882235          South Dakota       814180
2                 Alaska         737438                Alaska       710231
3                Florida       21299325               Florida     18801310
4            Puerto Rico        3195153           Puerto Rico      3725789
5          West Virginia        1805832         West Virginia      1852994
6                Vermont         626299               Vermont       625741
7                   Iowa        3156145                  Iowa      3046355
8                Georgia       10519475               Georgia      9687653
9           Pennsylvania       12807060          Pennsylvania     12702379
10              Maryland        6042718              Maryland      5773552
11           Mississippi        2986530           Mississippi      2967297
12              Illinois       12741080              Illinois     12830632
13                Hawaii        1420491                Hawaii      1360301
14            Washington        7535591            Washington      6724540
15              Nebraska        1929268              Nebraska      1826341
16         United States      327167434         United States    308745538
17                  Utah        3161105                  Utah      2763885
18         Massachusetts        6902149         Massachusetts      6547629
19                  Ohio       11689442                  Ohio     11536504
20  District of Columbia         702455  District of Columbia       601723
21               Wyoming         577737               Wyoming       563626
22        North Carolina       10383620        North Carolina      9535483
23          North Dakota         760077          North Dakota       672591
24             Wisconsin        5813568             Wisconsin      5686986
25               Montana        1062305               Montana       989415
26                Kansas        2911505                Kansas      2853118
27              Oklahoma        3943079              Oklahoma      3751351
28              Michigan        9995915              Michigan      9883640
29            New Jersey        8908520            New Jersey      8791894
30              Delaware         967171              Delaware       897934
31               Indiana        6691878               Indiana      6483802
32                 Idaho        1754208                 Idaho      1567582
33              Kentucky        4468402              Kentucky      4339367
34              Arkansas        3013825              Arkansas      2915918
35             Tennessee        6770010             Tennessee      6346105
36                Nevada        3034392                Nevada      2700551
37              New York       19542209              New York     19378102
38              Missouri        6126452              Missouri      5988927
39          Rhode Island        1057315          Rhode Island      1052567
40             Minnesota        5611179             Minnesota      5303925
41        South Carolina        5084127        South Carolina      4625364
42            California       39557045            California     37253956
43                 Maine        1338404                 Maine      1328361
44                 Texas       28701845                 Texas     25145561
45              Virginia        8517685              Virginia      8001024
46                Oregon        4190713                Oregon      3831074
47               Arizona        7171646               Arizona      6392017
48              Colorado        5695564              Colorado      5029196
49               Alabama        4887871               Alabama      4779736
50             Louisiana        4659978             Louisiana      4533372
51         New Hampshire        1356458         New Hampshire      1316470
52           Connecticut        3572665           Connecticut      3574097

There are three types of merges that can occur:
- One-to-one
- One-to-many (many-to-one)
- Many-to-many

The example above is a one-to-one merge, as there is exactly one row in the "left" data set associated with a row in the "right" data set and vice versa. If there are multiple rows associated with one row in the other DataFrame, the one row is repeated for each related row in the merge process.

## Sorting Data

Pandas supports sorting values in Series and DataFrames by a single or multiple columns. `sort_values` method accepts a `by` arguments that indicates a list of column labels to be used for sorting and `ascending` parameters that is list of boolean values indicating whether sort order for each of the specified columns should be ascending or descending.

In [ ]:
state_population.sort_values(by=["State"])

                   State  Estimate 2018             Geography  Census 2010
49               Alabama        4887871               Alabama      4779736
2                 Alaska         737438                Alaska       710231
47               Arizona        7171646               Arizona      6392017
34              Arkansas        3013825              Arkansas      2915918
42            California       39557045            California     37253956
48              Colorado        5695564              Colorado      5029196
52           Connecticut        3572665           Connecticut      3574097
30              Delaware         967171              Delaware       897934
20  District of Columbia         702455  District of Columbia       601723
3                Florida       21299325               Florida     18801310
8                Georgia       10519475               Georgia      9687653
13                Hawaii        1420491                Hawaii      1360301
32                 Idaho        1754208                 Idaho      1567582
12              Illinois       12741080              Illinois     12830632
31               Indiana        6691878               Indiana      6483802
7                   Iowa        3156145                  Iowa      3046355
26                Kansas        2911505                Kansas      2853118
33              Kentucky        4468402              Kentucky      4339367
50             Louisiana        4659978             Louisiana      4533372
43                 Maine        1338404                 Maine      1328361
10              Maryland        6042718              Maryland      5773552
18         Massachusetts        6902149         Massachusetts      6547629
28              Michigan        9995915              Michigan      9883640
40             Minnesota        5611179             Minnesota      5303925
11           Mississippi        2986530           Mississippi      2967297
38              Missouri        6126452              Missouri      5988927
25               Montana        1062305               Montana       989415
15              Nebraska        1929268              Nebraska      1826341
36                Nevada        3034392                Nevada      2700551
51         New Hampshire        1356458         New Hampshire      1316470
29            New Jersey        8908520            New Jersey      8791894
0             New Mexico        2095428            New Mexico      2059179
37              New York       19542209              New York     19378102
22        North Carolina       10383620        North Carolina      9535483
23          North Dakota         760077          North Dakota       672591
19                  Ohio       11689442                  Ohio     11536504
27              Oklahoma        3943079              Oklahoma      3751351
46                Oregon        4190713                Oregon      3831074
9           Pennsylvania       12807060          Pennsylvania     12702379
4            Puerto Rico        3195153           Puerto Rico      3725789
39          Rhode Island        1057315          Rhode Island      1052567
41        South Carolina        5084127        South Carolina      4625364
1           South Dakota         882235          South Dakota       814180
35             Tennessee        6770010             Tennessee      6346105
44                 Texas       28701845                 Texas     25145561
16         United States      327167434         United States    308745538
17                  Utah        3161105                  Utah      2763885
6                Vermont         626299               Vermont       625741
45              Virginia        8517685              Virginia      8001024
14            Washington        7535591            Washington      6724540
5          West Virginia        1805832         West Virginia      1852994
24             Wisconsin        5813568             Wisconsin      5686986
21               Wyoming         577737               Wyoming       563626

In [ ]:
clean_population = state_population.sort_values(by=["Estimate 2018"], ascending=False)
clean_population = clean_population.drop("Geography", axis=1)
clean_population.index = range(len(clean_population))
clean_population

                   State  Estimate 2018  Census 2010
0          United States      327167434    308745538
1             California       39557045     37253956
2                  Texas       28701845     25145561
3                Florida       21299325     18801310
4               New York       19542209     19378102
5           Pennsylvania       12807060     12702379
6               Illinois       12741080     12830632
7                   Ohio       11689442     11536504
8                Georgia       10519475      9687653
9         North Carolina       10383620      9535483
10              Michigan        9995915      9883640
11            New Jersey        8908520      8791894
12              Virginia        8517685      8001024
13            Washington        7535591      6724540
14               Arizona        7171646      6392017
15         Massachusetts        6902149      6547629
16             Tennessee        6770010      6346105
17               Indiana        6691878      6483802
18              Missouri        6126452      5988927
19              Maryland        6042718      5773552
20             Wisconsin        5813568      5686986
21              Colorado        5695564      5029196
22             Minnesota        5611179      5303925
23        South Carolina        5084127      4625364
24               Alabama        4887871      4779736
25             Louisiana        4659978      4533372
26              Kentucky        4468402      4339367
27                Oregon        4190713      3831074
28              Oklahoma        3943079      3751351
29           Connecticut        3572665      3574097
30           Puerto Rico        3195153      3725789
31                  Utah        3161105      2763885
32                  Iowa        3156145      3046355
33                Nevada        3034392      2700551
34              Arkansas        3013825      2915918
35           Mississippi        2986530      2967297
36                Kansas        2911505      2853118
37            New Mexico        2095428      2059179
38              Nebraska        1929268      1826341
39         West Virginia        1805832      1852994
40                 Idaho        1754208      1567582
41                Hawaii        1420491      1360301
42         New Hampshire        1356458      1316470
43                 Maine        1338404      1328361
44               Montana        1062305       989415
45          Rhode Island        1057315      1052567
46              Delaware         967171       897934
47          South Dakota         882235       814180
48          North Dakota         760077       672591
49                Alaska         737438       710231
50  District of Columbia         702455       601723
51               Vermont         626299       625741
52               Wyoming         577737       563626

# Tidy Data

Data comes in a variety of shapes and formats. "Tiday Data" paper attempts to formalize how we describe shape of data and define a goal in data cleaning process (https://vita.had.co.nz/papers/tidy-data.pdf). It provides a standard way to organize data values within a dataset.

As an example, compare the following representations of the same data.

In [ ]:
import pandas as pd
rep1 = pd.DataFrame({
    "name": ["John Smith", "Jane Doe", "Mary Johnson"],
    "treatmenta": [None, 16, 3],
    "treatmentb": [2, 11, 1]
})

rep1

In [ ]:
rep2 = pd.DataFrame({
    "": ["treatmenta", "treatmentb"],
    "John Smith": [None, 2],
    "Jane Doe": [16, 11],
    "Mary Johnson": [3, 1]
})

rep2

This simple example shows how different representations of the data could lead into different paths for analysis for potentially different outcomes. The mentioned paper, defined three principles of tidy data:
1. Columns represent separate variables
1. Rows represent individual observations
1. Observational units form tables

In the above example, columns in representation 1 are not separate variables, instead, they are different values ("a" and "b") for treatment variable. We can reorganize the above dataset into the new tidy format.

In [ ]:
rep_tidy = pd.DataFrame({
    "name": ["Jane", "Mary", "John", "Jane", "Mary"],
    "treatment": ["treatment a", "treatment a", "treatment b", "treatment b", "treatment b"],
    "value": [16, 3, 2, 11, 1]
})

rep_tidy

At a first glance, it seems the tidy format is more difficuly to read and find differences between treatment types. But we have to consider that some data formats are better for reporting and some better for analysis. Tidy data is aimed at improving analysis, rather than reporting.

The most common issue that needs to be fixed in tidying a dataset is columns containing values, instead of variables. Pandas provides `melt` function to fix this problem.

The first argument to the `melt` function is the DataFrame. A list of identifier columns should be passed by `id_vars` parameter. A list of columns containing the values for variables should be passed by `value_vars` parameter (columns to be melted).

In [ ]:
pd.melt(rep1, id_vars=["name"], value_vars=["treatmenta", "treatmentb"])

By default, the `melt` function names the variable column as `variable` and value column as `value`. We can use the `var_name` parameter to rename the variable column and `value_name` to rename the value column.

In [ ]:
pd.melt(rep1, id_vars=["name"], value_vars=["treatmenta", "treatmentb"], var_name="treatment", value_name="observation")

The opposite process of melting os called pivoting. In melting, we turn columns into rows, where in pivoting, we turn unique values into separate columns. This changes our dataset from an analysis friendly shape to a reporting friendly shape.

Below is an example of a case where pivoting can improve our dataset:

In [ ]:
temp_melt = pd.DataFrame({
    "date": ["2010-01-30", "2010-01-30", "2010-02-02", "2010-02-02"],
    "element": ["tmax", "tmin", "tmax", "tmin"],
    "value": [27.8, 14.5, 27.3, 14.4]
})

temp_melt

DataFrame objects have a `pivot` method to turn columns into rows. Using the `index` parameter of this function, we have to indicate which columns need remain fixed, `columns` for columns to break, and `values` for identifying columns containing the values (observations).

In [ ]:
temp_melt.pivot(index="date", columns="element", values="value")

`pivot` method does not work all the time. It requires all the columns to be broken to have exactly one observation for each row. In other words, it cannot deal with duplicate values for indices. Here is an example:

In [ ]:
temp_melt = pd.DataFrame({
    "date": ["2010-01-30", "2010-01-30", "2010-02-02", "2010-02-02", "2010-02-02"],
    "element": ["tmax", "tmin", "tmax", "tmin", "tmax"],
    "value": [27.8, 14.5, 27.3, 14.4, 28.1]
})

temp_melt

In [ ]:
try:
    temp_melt.pivot(index="date", columns="element", values="value")
except:
    print("Error performing pivot operation")

To avoid this problem, we should use the `pivot_table` method. This method has a parameter that specifies how to deal with duplicate values. To do this, we use the `aggfunc` parameter of this method to specify what function should be applied when there are multiple values for an index.

In [ ]:
temp_pivot = temp_melt.pivot_table(index="date", columns="element", values="value", aggfunc=np.mean)
temp_pivot

Sometimes after performing a pivot table operation, indices are modified and become different from the original dataset. To fix this problem, pandas provide a `reset_index` method on DataFrames to reset the index.

In [ ]:
temp_pivot.reset_index()